{
  "project": "Caspio Mobile App Fixes - Critical Issues",
  "version": "1.0",
  "created": "2026-01-14",
  "tasks": [
    {
      "id": "TASK-001",
      "title": "Multi-Image Upload Stuck Forever (MOBILE ONLY - NOT FIXED)",
      "description": "CRITICAL - NOT FIXED. Multiple photos in Structural Systems: 1 image stuck in queue forever on mobile. Force sync shows 'uploading' then back to queue. Mobile only issue - webapp works. TAKE TIME TO FIND ROOT CAUSE.",
      "mobile_only": true,
      "acceptance_criteria": [
        "All images sync on mobile (3, 4, 5+ images)",
        "No images stuck in queue permanently",
        "Force sync clears all queued items",
        "Matches webapp behavior"
      ],
      "investigation": "Compare mobile vs webapp upload flow. Check race conditions, batch limits, LocalImage outbox processing differences.",
      "passes": false,
      "priority": 1
    },
    {
      "id": "TASK-002",
      "title": "Random Hard Refreshes - Critical Stability (NOT FIXED)",
      "description": "CRITICAL - NOT FIXED. App hard refreshes randomly: clicking sync modal, images, saving annotations, after sync, entering rooms/categories. Makes app feel broken. SPEND AS MUCH TIME AS NEEDED. Find root cause: local data? broken data? memory? state corruption?",
      "acceptance_criteria": [
        "No hard refreshes during any normal operation",
        "App remains stable throughout user session",
        "Root cause identified and permanently resolved"
      ],
      "investigation": "Check unhandled exceptions, state corruption, IndexedDB errors, memory leaks, infinite loops, recursive reloads. Add global error handler. Extensive logging.",
      "passes": false,
      "priority": 2
    },
    {
      "id": "TASK-003",
      "title": "Optimize Page Load Speed (Zero Functionality Loss)",
      "description": "Structural categories and Rooms load too slow with loading screens. Optimize BUT CANNOT break: image display, photo showing, lazy loading, captions, annotations. Conservative safe optimizations only.",
      "acceptance_criteria": [
        "Pages load under 2 seconds",
        "ALL images display correctly",
        "ALL photos show up",
        "Lazy loading works",
        "Captions/annotations persist",
        "Zero functionality regression"
      ],
      "safe_optimizations": "Profile bottlenecks. Optimize DB queries. Defer non-visible content. Cache blob URLs. IF optimization risks stability - DON'T DO IT.",
      "passes": false,
      "priority": 3
    },
    {
      "id": "TASK-004",
      "title": "Annotations Not Syncing in Structural Categories",
      "description": "Annotations added in structural categories don't appear in sync queue and don't sync to backend.",
      "acceptance_criteria": [
        "Annotations appear in sync queue",
        "Annotations sync to Caspio successfully",
        "Sync modal shows annotation updates"
      ],
      "investigation": "Check if queueCaptionAndAnnotationUpdate() called. Verify IndexedDB outbox storage. Check background-sync processing.",
      "passes": false,
      "priority": 4
    }
  ]
}
