{
  "project": "Caspio Mobile App Fixes",
  "version": "1.0",
  "created": "2026-01-13",
  "tasks": [
    {
      "id": "TASK-001",
      "title": "Sync Modal Showing Stale Failed Sync Data",
      "description": "Sync window is showing all syncs as failing even though they were cleared and all images uploaded correctly. This appears to be stale cached data from previous failed attempts, not actual current failures.",
      "acceptance_criteria": [
        "Sync modal shows accurate current sync status",
        "Cleared syncs are removed from the failed list",
        "No stale cached failure data persists after clearing",
        "Sync status refreshes properly after manual clear"
      ],
      "passes": false,
      "priority": 1
    },
    {
      "id": "TASK-002",
      "title": "Phantom Broken Image After Multi-Image Upload in Structural Systems",
      "description": "STILL BROKEN. After syncing and refreshing in category-structural pages, an extra broken image appears when uploading multiple images via photo album. Upload 3 images, 4 are showing with one broken.",
      "acceptance_criteria": [
        "No phantom/extra broken images appear after multi-image upload",
        "Image count matches exactly what was uploaded",
        "Page refresh does not create duplicate image entries",
        "Photo album multi-upload maintains correct image count"
      ],
      "passes": false,
      "priority": 2,
      "note": "CRITICAL: Not resolved in previous pushes"
    },
    {
      "id": "TASK-003",
      "title": "FDF Images Disappearing During Sync in Elevation Plot/Rooms",
      "description": "STILL BROKEN. In Rooms pages (Elevation Plot), FDF images disappear during sync. Should be preserved via IndexedDB/cache. Works in Structural Systems but NOT Elevation Plot.",
      "acceptance_criteria": [
        "FDF images remain visible during entire sync process",
        "Images fallback to IndexedDB/cached version during sync",
        "No image flickering or disappearing during sync",
        "Behavior matches Structural Systems section"
      ],
      "passes": false,
      "priority": 3,
      "note": "CRITICAL: Not resolved in previous pushes"
    },
    {
      "id": "TASK-004",
      "title": "Annotations Corrupted and Captions Lost When Added Before Sync",
      "description": "STILL BROKEN. Annotations added before sync save as gzipped base64 instead of JSON. Captions also lost when added before sync for both FDF and Measurement points.",
      "acceptance_criteria": [
        "Annotations save as proper JSON format, not gzipped/compressed",
        "Annotations added before sync are preserved correctly after sync",
        "Captions added before sync are preserved correctly after sync",
        "Both FDF and Measurement point annotations/captions work correctly"
      ],
      "passes": false,
      "priority": 4,
      "note": "CRITICAL: Not resolved in previous pushes"
    }
  ]
}
