{
  "project": "Caspio Mobile App Fixes",
  "version": "1.0",
  "created": "2026-01-13",
  "tasks": [
    {
      "id": "TASK-001",
      "title": "FDF Question (Same/Different Elevation) Not Syncing",
      "description": "The FDF question for 'Same Elevation' or 'Different Elevation' dropdown value doesn't save/sync at all. This appears to be the root cause blocking other syncs - when this fails, subsequent sync items get stuck and eventually need to be cleared manually.",
      "acceptance_criteria": [
        "Same/Different Elevation dropdown value saves locally",
        "Value syncs successfully to Caspio backend",
        "Value persists after app restart",
        "No errors in sync queue related to this field"
      ],
      "passes": false,
      "priority": 1
    },
    {
      "id": "TASK-002",
      "title": "PDF Preview Missing All Images",
      "description": "When clicking the PDF preview in the app, all images are missing. This affects all PDF previews across all forms/templates - no images display regardless of image type.",
      "acceptance_criteria": [
        "All captured photos display in PDF preview",
        "Signature images display in PDF preview",
        "Any other image types display correctly",
        "Images render at appropriate resolution/quality"
      ],
      "passes": false,
      "priority": 3
    },
    {
      "id": "TASK-003",
      "title": "Sync Error Handling - Prevent Cascade Failures",
      "description": "Improve sync error handling to prevent a single failed item (like the FDF question) from blocking the entire sync queue. Implement comprehensive error handling including: skip failed items and continue syncing others with retry later, show clear error messages for each failed item without blocking the queue, and implement a circuit breaker pattern that pauses and alerts user after repeated failures.",
      "acceptance_criteria": [
        "Failed sync items are skipped, allowing other items to continue",
        "Failed items are automatically retried later",
        "Clear error messages shown for each individual failure",
        "Sync queue is not blocked by single item failures",
        "Circuit breaker activates after X consecutive failures",
        "User is alerted when circuit breaker triggers",
        "User can manually clear or retry failed items"
      ],
      "passes": false,
      "priority": 2,
      "dependencies": ["TASK-001"]
    }
  ]
}
