{
  "project": "Caspio Mobile App Fixes",
  "version": "1.0",
  "created": "2026-01-14",
  "tasks": [
    {
      "id": "TASK-001",
      "title": "Failed Syncs Not Showing in Failed Tab - Silent Failures",
      "description": "When adding photos in FDF, Measurement point, or Structural systems, syncing is obviously broken but not showing as failed sync. Syncs should retry until success, but failures must be visible in failed tab with error reason.",
      "console_error": "TypeError: S.attachId.startsWith is not a function - attachId is a number, not string",
      "root_cause": "attachId.startsWith() fails because attachId is a number. Need String(attachId).startsWith() - same fix pattern as entityId.startsWith",
      "acceptance_criteria": [
        "All sync failures captured and shown in failed tab",
        "Failed syncs show error reason/message",
        "Syncs continue retrying with exponential backoff",
        "No silent failures - every failed attempt logged and visible",
        "Fix TypeError: use String(attachId).startsWith() instead of attachId.startsWith()"
      ],
      "technical_approach": "Find all attachId.startsWith() calls, wrap in String(). Same fix as entityId.startsWith.",
      "passes": false,
      "priority": 1
    },
    {
      "id": "TASK-002",
      "title": "Duplicate Records Without Attachment Field - Broken Images",
      "description": "In LPS_Services_Visuals_Attach table, duplicate records are being created with annotation field but NO Attachment field. This causes broken images in UI - record exists but no actual image. Annotation updates should UPDATE existing records, not INSERT new ones.",
      "acceptance_criteria": [
        "Never create attachment records without Attachment field",
        "Annotation updates UPDATE existing records, not INSERT new",
        "No duplicate attachment records for same image",
        "Broken images eliminated from UI"
      ],
      "technical_approach": "Audit code creating LPS_Services_Visuals_Attach records. Ensure annotation saves UPDATE by AttachID. Add validation to prevent INSERT without Attachment.",
      "passes": false,
      "priority": 2
    }
  ]
}
