{
  "name": "Caspio Mobile App - Group 2: Critical Mobile Fixes - ISSUES STILL PERSIST",
  "branchName": "feature/critical-mobile-fixes-group2-retry",
  "skipAgents": ["tester"],
  "completionCriteria": "Mark complete when code edits are done - do not wait for testing",
  "criticalNote": "PREVIOUS FIX ATTEMPTS DID NOT WORK. These issues are STILL HAPPENING as of January 14, 2026. Do NOT assume previous commits fixed these issues - they did NOT. Fresh investigation and NEW fixes are required.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Multi-Image Upload - One Image Stuck in Queue Forever (MOBILE ONLY) - NOT FIXED",
      "description": "CRITICAL - NOT FIXED - ISSUE STILL PERSISTS. Previous fix attempts in commits 54960ed1, 0aa9602e did NOT resolve this issue. When adding multiple photos in Structural Systems (mobile app), 1 image remains stuck in queue forever. Clicking Sync shows 'uploading' briefly then back to queue. The FIRST image listed in the queue is typically the one that gets stuck. This ONLY happens on mobile app - webapp works perfectly fine. DO NOT ASSUME THIS IS FIXED - IT IS NOT. Requires fresh investigation and new solution.",
      "status": "NOT_FIXED",
      "previousAttemptsFailed": true,
      "mobileOnlyIssue": true,
      "acceptanceCriteria": [
        "All images in multi-image upload sync successfully on mobile",
        "No images get stuck in queue permanently",
        "First image in queue syncs correctly",
        "Force sync clears all queued items",
        "Works with 3, 4, 5+ images on mobile app",
        "Behavior matches webapp (which works correctly)"
      ],
      "investigationSteps": [
        "IGNORE previous fix attempts - they did not work",
        "Compare mobile vs webapp upload flow - what's different?",
        "Check if mobile has different batch size limits",
        "Look for race conditions in mobile-specific code paths",
        "Check LocalImage outbox processing on mobile",
        "Verify upload worker doesn't skip first item on mobile",
        "Check for mobile-specific network/blob handling differences",
        "Focus on why the FIRST image gets stuck specifically"
      ],
      "priority": 1,
      "skipTester": true,
      "markCompleteOnCodeEdit": true
    },
    {
      "id": "US-002",
      "title": "Random Hard Refreshes Throughout App - NOT FIXED - STILL HAPPENING",
      "description": "CRITICAL - NOT FIXED - ISSUE STILL PERSISTS. Previous fix attempts in commits 9a33cde3, 5a102ca9 did NOT resolve this issue. The mobile app STILL hard refreshes randomly and consistently, making it feel completely broken. Triggers include: clicking sync modal, clicking image, saving annotation, after sync completes, entering category/room. DO NOT ASSUME previous commits fixed this - THEY DID NOT. The issue is STILL happening as of January 14, 2026. Requires fresh investigation and entirely new approach.",
      "status": "NOT_FIXED",
      "previousAttemptsFailed": true,
      "acceptanceCriteria": [
        "No hard refreshes when clicking sync modal",
        "No hard refreshes when clicking images",
        "No hard refreshes when saving annotations",
        "No hard refreshes after sync completes",
        "No hard refreshes when navigating to categories/rooms",
        "App remains stable during all normal operations",
        "Root cause identified and permanently resolved"
      ],
      "investigationAreas": [
        "IGNORE previous fix attempts - they did not work",
        "Check for unhandled exceptions that trigger page reload",
        "Look for state corruption causing Angular to force reload",
        "Check IndexedDB errors that might crash change detection",
        "Look for memory leaks causing app to restart",
        "Check for infinite loops in liveQuery subscriptions",
        "Verify change detection doesn't trigger recursive reloads",
        "Check for broken data structures causing errors",
        "Add global error handler to catch and log before refresh happens",
        "Check window.location assignments or navigation.reload() calls",
        "Look for Zone.js errors causing full app reload"
      ],
      "priority": 2,
      "skipTester": true,
      "markCompleteOnCodeEdit": true
    },
    {
      "id": "US-003",
      "title": "Optimize Structural Categories and Rooms Page Load Speed - STILL SLOW",
      "description": "Loading of structural categories pages STILL shows loading screen and takes too long to load. Rooms STILL take too long to load. Previous optimization attempts did not sufficiently improve performance. Need additional optimization while maintaining 100% of current functionality. Do NOT lose any functionality - same features must work exactly as before, just faster.",
      "status": "NOT_FIXED",
      "previousAttemptsFailed": true,
      "acceptanceCriteria": [
        "Structural category pages load faster",
        "Rooms load faster",
        "ALL images still display correctly - no disappearance",
        "ALL photos still show up - no missing images",
        "Lazy loading still works",
        "Captions persist correctly",
        "Annotations persist correctly",
        "Zero functionality regression"
      ],
      "safeOptimizationStrategies": [
        "Profile to find actual bottlenecks (don't guess)",
        "Optimize database queries (indexes, batch reads)",
        "Defer non-visible content (below fold)",
        "Use virtual scrolling for long lists if applicable",
        "Optimize blob URL generation (cache, reuse)",
        "Reduce redundant change detection cycles",
        "Check for N+1 query patterns"
      ],
      "safetyConstraints": [
        "DO NOT break image display logic",
        "DO NOT change LocalImages loading flow in ways that break display",
        "DO NOT modify lazy loading logic in ways that break it",
        "MUST maintain all existing functionality",
        "If optimization risks stability - DON'T DO IT"
      ],
      "priority": 3,
      "skipTester": true,
      "markCompleteOnCodeEdit": true
    }
  ],
  "agentInstructions": {
    "skipTester": true,
    "completionTrigger": "code_edits_complete",
    "criticalWarning": "DO NOT assume previous commits fixed these issues. They did NOT. All issues are STILL occurring. Fresh investigation and NEW code changes are REQUIRED.",
    "notes": "Skip the Tester agent. Mark tasks complete when code edits are done."
  },
  "metadata": {
    "updatedAt": "2026-01-14T07:00:00.000Z",
    "previousFixAttemptsFailed": true,
    "issuesStillPersist": true
  }
}
