{
  "name": "Caspio Mobile App - Dexie-First Implementation",
  "branchName": "feature/dexie-first-implementation",
  "criticalRequirement": "DEXIE-FIRST IS NON-NEGOTIABLE. All data must flow through Dexie (IndexedDB). Do NOT settle for alternative approaches, workarounds, or shortcuts. LocalImages table is the single source of truth for photos. displayUrl must ALWAYS point to local blob storage, NEVER swap to server URLs.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Category Detail - Fix Remaining Dexie-First Photo Issues",
      "status": "NOT_FIXED",
      "description": "NOT FIXED IN LAST ITERATION. The category-detail page's Dexie-first implementation is almost working perfectly. Two remaining issues persist despite previous fix attempts.",
      "page": "src/app/pages/engineers-foundation/structural-systems/category-detail",
      "issues": [
        {
          "id": "ISSUE-1A",
          "title": "Photo Disappears After Syncing",
          "description": "After syncing, the photo disappears from the UI. The implementation MUST continue to point to local data storage (Dexie LocalImages table) and NOT swap to synced server data. LocalImages should remain the source of truth for display.",
          "status": "NOT_FIXED"
        },
        {
          "id": "ISSUE-1B",
          "title": "Photo Thumbnail Missing Annotations on Reload",
          "description": "On reload of the page, the photo thumbnail does not show annotations. Annotations should persist and display correctly after page reload.",
          "status": "NOT_FIXED"
        }
      ],
      "nextSteps": [
        "ADD DEBUG STATEMENTS on category page load to trace photo population flow",
        "ADD DEBUG STATEMENTS on photo upload to trace LocalImage creation and displayUrl assignment",
        "ADD DEBUG STATEMENTS on sync completion to trace what happens to displayUrl",
        "ADD DEBUG STATEMENTS for annotation loading on page reload",
        "Identify WHY displayUrl is being swapped or lost after sync",
        "Identify WHY annotations are not loading from cachedAnnotatedImages on reload"
      ],
      "acceptanceCriteria": [
        "Photos remain visible after sync completes (local data reference maintained)",
        "Annotations display correctly on photo thumbnails after page reload",
        "displayUrl ALWAYS points to local blob (blob: or data:), NEVER server URL",
        "No regression to existing Dexie-first functionality",
        "Visual selections remain stable (no deselection issues)"
      ],
      "technicalContext": [
        "DEXIE-FIRST: LocalImages table stores photos with stable imageId",
        "DEXIE-FIRST: displayUrl must ALWAYS point to local blob, NEVER swap to server URL",
        "Annotations are stored in cachedAnnotatedImages table in Dexie",
        "Sync should update metadata only, NOT displayUrl",
        "DO NOT abandon Dexie approach for alternative solutions"
      ],
      "priority": 1,
      "passes": false,
      "dependsOn": []
    },
    {
      "id": "US-002",
      "title": "Room Elevation - Implement Dexie-First for Room Details",
      "status": "NOT_FIXED",
      "description": "NOT FIXED IN LAST ITERATION. Implement Dexie-first approach for the room-elevation page (individual room detail view with elevation points). The elevation plot section has a DIFFERENT data structure than structural systems, so a NEW Dexie table is needed for elevation plot data.",
      "page": "src/app/pages/engineers-foundation/room-elevation",
      "issues": [
        {
          "id": "ISSUE-2A",
          "title": "Photo Does Not Show on Original Load",
          "description": "When adding an image to an elevation point, it is completely gone immediately - does not appear in the UI after capture.",
          "status": "NOT_FIXED"
        },
        {
          "id": "ISSUE-2B",
          "title": "Photo Does Not Persist on Page Reload",
          "description": "Photos disappear when navigating away and returning to the room, or on hard refresh.",
          "status": "NOT_FIXED"
        },
        {
          "id": "ISSUE-2C",
          "title": "Photo Disappears After Sync",
          "description": "After syncing, photos disappear. Implementation MUST point locally so sync should NOT change the image display. We are pointing to Dexie LocalImages, NOT server URLs.",
          "status": "NOT_FIXED"
        },
        {
          "id": "ISSUE-2D",
          "title": "Annotations and Captions Do Not Persist",
          "description": "User-added annotations and captions on elevation point photos are lost on navigation or reload.",
          "status": "NOT_FIXED"
        }
      ],
      "nextSteps": [
        "ADD DEBUG STATEMENTS on room-elevation page load to trace photo population flow",
        "ADD DEBUG STATEMENTS on photo upload to trace LocalImage creation and displayUrl assignment",
        "ADD DEBUG STATEMENTS on sync completion to trace what happens to displayUrl",
        "ADD DEBUG STATEMENTS for annotation/caption loading on page reload",
        "Create NEW Dexie table for EFE room/point data (similar to VisualFieldRepo but for EFE structure)",
        "Implement EfeFieldRepo service following same pattern as VisualFieldRepo",
        "Ensure photos are read from LocalImages table, not server attachments"
      ],
      "acceptanceCriteria": [
        "New Dexie table created for elevation plot data (efeFields or similar)",
        "Elevation point photos display immediately after capture",
        "Photos persist after page navigation and reload",
        "Photos remain visible after sync (local data reference maintained)",
        "Annotations and captions persist across navigation/reload",
        "displayUrl ALWAYS points to local blob (blob: or data:), NEVER server URL",
        "FDF photos also follow Dexie-first pattern",
        "Point values (elevation readings) persist correctly",
        "Notes, Location, FDF fields persist correctly"
      ],
      "technicalContext": [
        "DEXIE-FIRST: Must create new Dexie table for EFE data structure",
        "DEXIE-FIRST: LocalImages table is source of truth for photos",
        "DEXIE-FIRST: displayUrl must ALWAYS point to local blob, NEVER server URL",
        "Room has multiple elevation points (Point1-Point20)",
        "Each point can have multiple photos",
        "FDF section has separate photo slots (top, bottom, etc.)",
        "Must integrate with existing EFE point sync process without breaking it",
        "DO NOT abandon Dexie approach for alternative solutions"
      ],
      "priority": 2,
      "passes": false,
      "dependsOn": []
    }
  ],
  "metadata": {
    "updatedAt": "2026-01-15T18:00:00.000Z",
    "emphasis": "DEXIE-FIRST IS MANDATORY. No shortcuts, no workarounds, no settling for non-Dexie solutions.",
    "previousStories": [
      {
        "id": "US-001-OLD",
        "title": "Reduce Category/Room Page Load Times (Zero Data Loss)",
        "status": "completed",
        "completionNotes": "Completed by agent"
      },
      {
        "id": "US-002-OLD",
        "title": "Hard Refreshes - 'Preparing Template' Screen",
        "status": "completed",
        "completionNotes": "Completed by agent"
      },
      {
        "id": "US-003-REMOVED",
        "title": "Elevation Plot Hub - Implement Dexie-First for Rooms List",
        "status": "merged_into_US-002",
        "completionNotes": "Room list functionality merged into room-elevation task as photos are handled there"
      }
    ]
  }
}
