{
  "name": "Caspio Mobile App - Group 2: Critical Mobile Fixes",
  "skipAgents": ["tester"],
  "userStories": [
    {
      "id": "US-001",
      "title": "First Photo Album Upload on New Visual - Stuck Queue Issue (MOBILE ONLY)",
      "description": "CRITICAL: In structural systems section (structural-category pages), the FIRST photo uploaded via photo album to a NEW visual gets stuck in sync queue and fails. Second and subsequent photos sync successfully. Camera photos work fine as first photo. The issue is SPECIFICALLY the first photo album upload on a newly created visual.",
      "mobileOnlyIssue": true,
      "completed": false,
      "narrowedDownCause": {
        "trigger": "First photo album upload on a NEW visual",
        "worksCorrectly": [
          "Camera photos as first photo on new visual",
          "Second and subsequent photo album uploads",
          "Photo album uploads on existing visuals with photos"
        ],
        "fails": [
          "First photo album upload on a brand new visual"
        ]
      },
      "symptoms": [
        "First photo from album on new visual stuck in sync queue",
        "Backend gets row without an Attachment for first photo",
        "Broken/missing image in UI for first photo",
        "Second+ photos sync successfully"
      ],
      "acceptanceCriteria": [
        "First photo album upload on new visual syncs successfully",
        "No photos stuck in queue regardless of upload order",
        "Backend rows all have attachments",
        "No broken/missing image links in UI",
        "Works for: first camera photo, first album photo, multiple album photos"
      ],
      "investigationSteps": [
        "Compare code path for camera capture vs photo album on NEW visual",
        "Check if visual record is fully created before first album upload starts",
        "Look for race condition between visual creation and first photo album upload",
        "Check if camera capture has different timing/sequencing that avoids the bug",
        "Investigate IndexedDB state when first album photo is added to new visual",
        "Check if second photo succeeds because visual is now fully initialized"
      ],
      "priority": 1
    },
    {
      "id": "US-002",
      "title": "Add New Modal Photos Sync But Don't Display in UI (MOBILE ONLY)",
      "description": "Images added through the 'Add New' modals (Add New Deficiency, Add New Limitation, Add New Comment) sync successfully to backend but do NOT display in the UI. User adds a new deficiency with 3 photos, all photos sync, visual shows as checked, but no images appear in the UI.",
      "mobileOnlyIssue": true,
      "completed": false,
      "affectedModals": [
        "Add New Deficiency",
        "Add New Limitation",
        "Add New Comment"
      ],
      "symptoms": [
        "Photos added in 'Add New' modals sync successfully to backend",
        "Visual shows as checked (indicating data exists)",
        "UI does not display the uploaded images",
        "Images exist in backend but not shown to user"
      ],
      "acceptanceCriteria": [
        "Photos added in Add New Deficiency modal display in UI after sync",
        "Photos added in Add New Limitation modal display in UI after sync",
        "Photos added in Add New Comment modal display in UI after sync",
        "Visual checked status matches visible image count",
        "No disconnect between backend data and UI display"
      ],
      "investigationSteps": [
        "Trace photo upload flow in Add New modal components",
        "Check if photos are being saved with correct visual/entity IDs",
        "Investigate if UI query is missing the newly created photos",
        "Check if there's a refresh/reload issue after modal closes",
        "Compare how existing deficiency photos load vs new modal photos",
        "Check LocalImage entity association for modal-created items"
      ],
      "priority": 2
    }
  ],
  "completedStories": [
    {
      "id": "US-003",
      "title": "Random Hard Refreshes Throughout App - FIXED",
      "fixedIn": "commit 93e1ad55 in zeroshot/ruby-atlas-15 branch",
      "solution": "Changed auto-reload to user confirmation dialog to prevent unexpected hard refreshes"
    }
  ],
  "metadata": {
    "updatedAt": "2026-01-14T11:20:00.000Z"
  }
}
