{
  "name": "Caspio Mobile App Fixes",
  "branchName": "feature/caspio-mobile-app-fixes",
  "userStories": [
    {
      "id": "US-001",
      "title": "Hard Refresh and Broken Images During Sync in Structural Systems",
      "description": "In Structural Systems, right after or during the sync process, if I open a category page (e.g., Foundations) the app hard refreshes. Then there is an extra broken image showing in the UI for multi-images loaded with the photo album. Eventually the broken image disappears when revisiting the category.",
      "acceptanceCriteria": [
        "No hard refresh when opening category pages during sync",
        "No broken/phantom images appear in the UI during or after sync",
        "Photo album multi-image loading handles sync state correctly",
        "UI remains stable during background sync operations"
      ],
      "priority": 1,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-002",
      "title": "Show Failed Syncs with Error Details in Sync Modal",
      "description": "Failed syncs occur without being able to see why they failed. Need a tab at the top of the photo sync modal that shows what syncs failed and why.",
      "acceptanceCriteria": [
        "New tab in sync modal showing failed sync items",
        "Each failed item shows the error reason/message",
        "Failed items are clearly distinguishable from pending/successful items",
        "User can see detailed error information for debugging"
      ],
      "priority": 2,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-003",
      "title": "Random Sync Failures on Auto-Sync (1-minute interval)",
      "description": "When manually syncing immediately after adding room, FDF, images, and captions - no problems. But when adding multiple items and letting the 1-minute auto-sync happen, seemingly random failures occur. Need to see these issues in the Sync Modal to resolve them.",
      "acceptanceCriteria": [
        "Auto-sync (1-minute interval) works as reliably as manual sync",
        "All sync failures are visible in the Sync Modal with details",
        "No unexplained random failures during auto-sync",
        "Root cause of auto-sync failures is identified and fixed"
      ],
      "priority": 3,
      "passes": true,
      "dependsOn": [
        "US-002"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-004",
      "title": "Eliminate Random Hard Refreshes Throughout App",
      "description": "Random hard refreshes occur throughout the app. Adding a caption to a queued image caused a hard refresh. The app needs to be solid - force refreshing feels like the app is failing/breaking. Everything needs to operate in an unbreakable way.",
      "acceptanceCriteria": [
        "No hard refreshes when adding captions to queued images",
        "No unexpected page reloads during normal operations",
        "App maintains stable state during all user interactions",
        "Error handling is graceful without forcing page refreshes"
      ],
      "priority": 4,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-005",
      "title": "Annotations Not Showing on Queued Image Thumbnails in Elevation Plot",
      "description": "When adding annotations to an image that is queued to sync in the Elevation Plot section, the annotation does not show in the photo thumbnail. Adding annotations to already synced images works perfectly.",
      "acceptanceCriteria": [
        "Annotations display on thumbnails for queued (unsynced) images",
        "Annotation preview matches behavior of synced images",
        "Local annotation data is properly rendered before sync completes"
      ],
      "priority": 5,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    }
  ],
  "metadata": {
    "updatedAt": "2026-01-13T22:06:18.396Z"
  }
}