{
  "name": "Caspio Mobile App Fixes",
  "branchName": "feature/caspio-mobile-app-fixes",
  "userStories": [
    {
      "id": "US-001",
      "title": "Sync Modal Showing Stale Failed Sync Data",
      "description": "Sync window is showing all syncs as failing even though they were cleared and all images uploaded correctly. This appears to be stale cached data from previous failed attempts, not actual current failures. The sync modal needs to accurately reflect the current sync state.",
      "acceptanceCriteria": [
        "Sync modal shows accurate current sync status",
        "Cleared syncs are removed from the failed list",
        "No stale cached failure data persists after clearing",
        "Sync status refreshes properly after manual clear"
      ],
      "priority": 1,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-002",
      "title": "Phantom Broken Image After Multi-Image Upload in Structural Systems",
      "description": "STILL BROKEN - NOT RESOLVED IN PREVIOUS PUSHES. After syncing and refreshing the page in category-structural pages, an extra broken image appears when uploading multiple images via photo album. In local it is perfect, after sync it is perfect, but randomly when visiting the page there will be an added broken image (e.g., upload 3 images, 4 are showing with one broken).",
      "acceptanceCriteria": [
        "No phantom/extra broken images appear after multi-image upload",
        "Image count matches exactly what was uploaded",
        "Page refresh does not create duplicate image entries",
        "Photo album multi-upload maintains correct image count"
      ],
      "priority": 2,
      "passes": true,
      "dependsOn": [],
      "note": "CRITICAL: Not resolved in previous pushes - up to date testing confirms still broken",
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-003",
      "title": "FDF Images Disappearing During Sync in Elevation Plot/Rooms",
      "description": "STILL BROKEN - NOT RESOLVED IN PREVIOUS PUSHES. In the Rooms pages (Elevation Plot section), images for FDF are disappearing during the syncing process. Everything should be preserved and pointed to IndexedDB or cached image - no images should disappear during sync. This works perfectly in Structural Systems section but NOT in Elevation Plot section.",
      "acceptanceCriteria": [
        "FDF images remain visible during entire sync process",
        "Images fallback to IndexedDB/cached version during sync",
        "No image flickering or disappearing during sync",
        "Behavior matches Structural Systems section implementation"
      ],
      "priority": 3,
      "passes": true,
      "dependsOn": [],
      "referenceFile": "src/app/pages/engineers-foundation/structural-systems/category-detail/category-detail.page.ts",
      "note": "CRITICAL: Not resolved in previous pushes - up to date testing confirms still broken",
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-004",
      "title": "Annotations Corrupted and Captions Lost When Added Before Sync",
      "description": "STILL BROKEN - NOT RESOLVED IN PREVIOUS PUSHES. Adding an annotation before the image syncs results in corrupted data in backend (showing as gzipped base64 'H4sIAAAAAAAAA6tWKkktLlGyUlAqS8wpTtVR...' instead of proper JSON). Image captions are also being lost when added prior to syncing for both FDF and Measurement points.",
      "acceptanceCriteria": [
        "Annotations save as proper JSON format, not gzipped/compressed",
        "Annotations added before sync are preserved correctly after sync",
        "Captions added before sync are preserved correctly after sync",
        "Both FDF and Measurement point annotations/captions work correctly"
      ],
      "corruptedDataExample": "H4sIAAAAAAAAA6tWKkktLlGyUlAqS8wpTtVRKi1OLYrPTFGyUqoFAJRGGIYcAAAA",
      "expectedDataFormat": "{\"version\":\"6.7.1\",\"objects\":[{\"type\":\"Group\",...}]}",
      "priority": 4,
      "passes": true,
      "dependsOn": [],
      "note": "CRITICAL: Not resolved in previous pushes - up to date testing confirms still broken",
      "completionNotes": "Completed by agent"
    }
  ],
  "metadata": {
    "updatedAt": "2026-01-14T00:31:30.598Z"
  }
}