{
  "name": "Caspio Mobile App - Local-First Until Finalization",
  "description": "Implement local-first data display pattern where all UI data comes from IndexedDB/LocalImages until the report is finalized. This eliminates image flickering, disappearing, and persistence issues during the inspection workflow.",
  "branchName": "feature/local-first-architecture",
  "userStories": [
    {
      "id": "US-001",
      "title": "Always Display Images from LocalImages Table in Elevation Plot",
      "description": "Modify room-elevation.page.ts to always display images from the LocalImages Dexie table instead of switching to remote S3/Caspio URLs after sync. The sync still happens in background, but UI always shows the local blob data until finalization.",
      "currentState": "NOT CORRECTLY IMPLEMENTED - The code currently SWAPS displayUrl from local blob to remote URL after sync completes. At lines 298-303 in room-elevation.page.ts, after sync the code calls fetchS3ImageAsDataUrl() and then sets photo.displayUrl = dataUrl (the remote image). This swap causes images to flicker/disappear when: (1) S3 fetch fails, (2) network is slow, (3) race conditions occur, (4) blob URL gets garbage collected before swap completes.",
      "problemCode": "Lines 298-303: photo.url = dataUrl; if (!hasExistingAnnotations) { photo.displayUrl = dataUrl; } - This is the URL SWAP that causes issues",
      "acceptanceCriteria": [
        "All FDF images display from LocalImages table, never from remote URLs",
        "All Measurement Point images display from LocalImages table",
        "Images never flicker or disappear during sync process",
        "Image display is consistent regardless of sync status",
        "Synced status is tracked separately (not by URL change)",
        "REMOVE the displayUrl swap logic at lines 298-303"
      ],
      "technicalApproach": [
        "REMOVE the photo.displayUrl = dataUrl swap after sync (lines 298-303)",
        "In getPhotoDisplayUrl(), always return LocalImages blob URL if available",
        "Track sync status via isSynced flag on LocalImage record, not URL",
        "Ensure loadPhotosForPoint() prioritizes LocalImages over remote attachments",
        "Never call fetchS3ImageAsDataUrl() to swap display during sync"
      ],
      "priority": 1,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-002",
      "title": "Always Display Images from LocalImages Table in Structural Systems",
      "description": "Ensure category-detail.page.ts maintains local-first display pattern. Verify that all visual photos, captions, and annotations display from LocalImages/IndexedDB and never switch to remote URLs until finalization.",
      "acceptanceCriteria": [
        "All visual photos display from LocalImages table",
        "Captions persist from local storage, not remote",
        "Annotations persist from local storage, not remote",
        "No image flickering during sync in Structural Systems",
        "Pattern matches Elevation Plot implementation"
      ],
      "technicalApproach": [
        "Audit getPhotoDisplayUrl() to ensure LocalImages priority",
        "Verify loadPhotosForVisual() uses LocalImages first",
        "Ensure annotation overlays use local annotatedDataUrl"
      ],
      "priority": 2,
      "passes": true,
      "dependsOn": [
        "US-001"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-003",
      "title": "Track Sync Status Separately from Display URL",
      "description": "Modify LocalImage record structure to track sync status independently from the display URL. Add isSynced boolean and remoteAttachmentId fields so we know what's synced without changing what's displayed.",
      "acceptanceCriteria": [
        "LocalImage has isSynced: boolean field",
        "LocalImage has remoteAttachmentId: string field (populated after sync)",
        "LocalImage has remoteUrl: string field (stored but not displayed until finalization)",
        "Sync process updates these fields without changing displayUrl/blobData",
        "UI can show sync status indicator without changing image source"
      ],
      "technicalApproach": [
        "Update LocalImage interface in local-image.service.ts",
        "Modify background-sync.service.ts to update isSynced and remoteAttachmentId after successful upload",
        "Keep blobData intact until finalization",
        "Add optional sync status badge to photo thumbnails"
      ],
      "priority": 3,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-004",
      "title": "Extend Finalize Button to Update Image Pointers",
      "description": "Add logic to existing Finalize Report button that updates all image references from local blob URLs to remote S3/Caspio URLs. This is when the 'swap' happens - only after inspector confirms report is complete.",
      "acceptanceCriteria": [
        "Finalize button triggers pointer update process",
        "All LocalImage records with isSynced=true get their display updated to remoteUrl",
        "Any unsynced images are force-synced before finalization completes",
        "User sees progress indicator during finalization",
        "Finalization fails gracefully if any images failed to sync"
      ],
      "technicalApproach": [
        "Add updateImagePointersToRemote() method",
        "Query all LocalImages for current template/project",
        "For each with isSynced=true: update any cached references to use remoteUrl",
        "For each with isSynced=false: queue for immediate sync, wait for completion",
        "Show confirmation dialog before starting finalization"
      ],
      "priority": 4,
      "passes": true,
      "dependsOn": [
        "US-003"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-005",
      "title": "Clean Up Local Data After Finalization",
      "description": "After finalization completes and all pointers are updated to remote URLs, clean up local blob data from IndexedDB to free up device storage. Keep metadata but remove large binary data.",
      "acceptanceCriteria": [
        "Local blob data is deleted after successful finalization",
        "Device storage is freed up",
        "Metadata (captions, annotations JSON, remoteUrl) is preserved",
        "User can still view images via remote URLs after cleanup",
        "Cleanup only happens after confirming all syncs succeeded"
      ],
      "technicalApproach": [
        "Add cleanupLocalBlobData() method to local-image.service.ts",
        "Set blobData to null for finalized images",
        "Keep annotationsJson and caption fields intact",
        "Log cleanup statistics (bytes freed, images processed)",
        "Run cleanup after successful pointer update"
      ],
      "priority": 5,
      "passes": true,
      "dependsOn": [
        "US-004"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-006",
      "title": "Handle Captions and Annotations in Local-First Pattern",
      "description": "Ensure captions and annotations follow the same local-first pattern. They should be stored and displayed from local storage until finalization, then the Caspio backend becomes the source of truth.",
      "acceptanceCriteria": [
        "Captions display from LocalImages.caption field, not remote",
        "Annotations display from LocalImages.annotationsJson field, not remote",
        "Editing captions/annotations updates local storage immediately",
        "Changes sync to Caspio in background but don't affect display",
        "Finalization updates Caspio with final caption/annotation values"
      ],
      "technicalApproach": [
        "Ensure saveCaptionLocally() stores to LocalImages table",
        "Ensure saveAnnotationLocally() stores to LocalImages table",
        "Background sync sends updates to Caspio without changing local display",
        "Finalization verifies local and remote are in sync"
      ],
      "priority": 6,
      "passes": true,
      "dependsOn": [
        "US-001",
        "US-002"
      ],
      "completionNotes": "Completed by agent"
    }
  ],
  "metadata": {
    "updatedAt": "2026-01-14T02:23:58.477Z"
  }
}