{
  "name": "Caspio Mobile App Fixes - Critical Issues",
  "branchName": "feature/critical-stability-fixes",
  "userStories": [
    {
      "id": "US-001",
      "title": "Multi-Image Upload - One Image Stuck in Queue Forever (MOBILE ONLY)",
      "description": "CRITICAL - NOT FIXED. When adding multiple photos in Structural Systems (mobile app), 1 image remains stuck in queue forever. Clicking Sync shows 'uploading' briefly then back to queue. Pattern: Upload 3 images, 2 sync, 1 stuck forever. Upload 4 images, 3 sync, 1 stuck. This ONLY happens on mobile app - webapp works perfectly. TAKE YOUR TIME AND FIND THE ROOT CAUSE.",
      "mobileOnlyIssue": true,
      "acceptanceCriteria": [
        "All images in multi-image upload sync successfully on mobile",
        "No images get stuck in queue permanently",
        "Force sync clears all queued items",
        "Works with 3, 4, 5+ images on mobile app",
        "Behavior matches webapp (which works correctly)"
      ],
      "investigationSteps": [
        "Compare mobile vs webapp upload flow - what's different?",
        "Check if mobile has different batch size limits",
        "Look for race conditions in mobile-specific code paths",
        "Check LocalImage outbox processing on mobile",
        "Verify upload worker doesn't skip items on mobile",
        "Check for mobile-specific network/blob handling differences"
      ],
      "priority": 1,
      "passes": false,
      "dependsOn": []
    },
    {
      "id": "US-002",
      "title": "Random Hard Refreshes Throughout App - Critical Stability Issue",
      "description": "CRITICAL - NOT FIXED. The mobile app hard refreshes randomly and consistently, making it feel completely broken. Triggers: clicking sync modal, clicking image, saving annotation, after sync completes, entering category/room. NOT PREVIOUSLY FIXED - still happening. SPEND AS MUCH TIME AS NEEDED. RUN AS MANY TESTS AS NEEDED. Find the root cause: Is it local data saving? Broken data? Memory issue? State corruption?",
      "acceptanceCriteria": [
        "No hard refreshes when clicking sync modal",
        "No hard refreshes when clicking images",
        "No hard refreshes when saving annotations",
        "No hard refreshes after sync completes",
        "No hard refreshes when navigating to categories/rooms",
        "App remains stable during all normal operations",
        "Root cause identified and permanently resolved"
      ],
      "investigationAreas": [
        "Check for unhandled exceptions that trigger page reload",
        "Look for state corruption causing Angular to force reload",
        "Check IndexedDB errors that might crash change detection",
        "Look for memory leaks causing app to restart",
        "Check for infinite loops in liveQuery subscriptions",
        "Verify change detection doesn't trigger recursive reloads",
        "Check for broken data structures causing errors",
        "Add global error handler to catch and log before refresh happens"
      ],
      "testingApproach": [
        "Add extensive logging before each potential refresh trigger",
        "Wrap all IndexedDB operations in try-catch with logging",
        "Monitor browser console for errors immediately before refresh",
        "Test each user action systematically to reproduce refresh",
        "Use performance profiling to detect memory/CPU spikes"
      ],
      "priority": 2,
      "passes": false,
      "dependsOn": []
    },
    {
      "id": "US-003",
      "title": "Optimize Page Load Speed Without Breaking Functionality",
      "description": "Structural category pages and Rooms take too long to load with loading screens. Need optimization but CANNOT affect: image disappearance, photos not showing, lazy loading, captions, annotations. Must optimize while maintaining 100% current functionality. Conservative, safe optimizations only.",
      "acceptanceCriteria": [
        "Structural category pages load faster (under 2 seconds)",
        "Rooms load faster (under 2 seconds)",
        "ALL images still display correctly - no disappearance",
        "ALL photos still show up - no missing images",
        "Lazy loading still works",
        "Captions persist correctly",
        "Annotations persist correctly",
        "Zero functionality regression"
      ],
      "safeOptimizationStrategies": [
        "Profile to find actual bottlenecks (don't guess)",
        "Optimize database queries (indexes, batch reads)",
        "Defer non-visible content (below fold)",
        "Use virtual scrolling for long lists",
        "Optimize blob URL generation (cache, reuse)",
        "Reduce redundant change detection cycles"
      ],
      "safetyConstraints": [
        "DO NOT touch image display logic",
        "DO NOT change LocalImages loading flow",
        "DO NOT modify lazy loading logic",
        "MUST maintain all existing functionality",
        "Test extensively before deploying",
        "If optimization risks stability - DON'T DO IT"
      ],
      "priority": 3,
      "passes": false,
      "dependsOn": []
    },
    {
      "id": "US-004",
      "title": "Annotations Not Syncing in Structural Categories",
      "description": "When adding an annotation in structural categories, it does not show up in the queue to be synced. Annotations are not being synced to the backend.",
      "acceptanceCriteria": [
        "Annotations appear in sync queue after being added",
        "Annotations sync to Caspio backend successfully",
        "Annotation data is properly formatted for sync",
        "Sync modal shows annotation updates as pending items"
      ],
      "investigationSteps": [
        "Check if queueCaptionAndAnnotationUpdate() is being called",
        "Verify annotation data is being stored in IndexedDB outbox",
        "Check if annotation sync requests have correct format",
        "Verify background-sync.service processes annotation updates",
        "Check for validation that might be rejecting annotation syncs"
      ],
      "priority": 4,
      "passes": false,
      "dependsOn": []
    }
  ],
  "metadata": {
    "updatedAt": "2026-01-14T05:07:52.597Z"
  }
}