{
  "name": "Caspio Mobile App Fixes",
  "branchName": "feature/sync-reliability-fixes",
  "userStories": [
    {
      "id": "US-001",
      "title": "Failed Syncs Not Showing in Failed Tab - Silent Failures",
      "description": "Sometimes when adding a photo in FDF, Measurement point, or Structural systems, the syncing is obviously broken but it is not showing up as a failed sync. Syncs should sustain/retry until they eventually succeed, but failures must be visible in the failed tab with the reason why they failed.",
      "consoleError": "[BackgroundSync] Sync failed: TypeError: S.attachId.startsWith is not a function at main.js:1:743311 at Array.filter",
      "rootCause": "attachId is a number (not a string) when .startsWith() is called on it. This is the same pattern as the previous entityId.startsWith error - need to convert attachId to String() before calling .startsWith().",
      "acceptanceCriteria": [
        "All sync failures are captured and shown in the failed tab",
        "Failed syncs show the error reason/message",
        "Syncs continue retrying until successful (with exponential backoff)",
        "No silent failures - every failed attempt is logged and visible",
        "User can see what went wrong for each failed sync item",
        "Fix TypeError: attachId.startsWith by converting to String(attachId) before calling .startsWith()"
      ],
      "technicalApproach": [
        "Find all occurrences of attachId.startsWith() in the codebase",
        "Wrap attachId in String() before calling .startsWith()",
        "Same fix pattern as entityId.startsWith fix applied previously"
      ],
      "priority": 1,
      "passes": true,
      "dependsOn": [],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-002",
      "title": "Duplicate Records Created Without Attachment Field - Broken Images",
      "description": "In LPS_Services_Visuals_Attach table, images are being added that appear to be duplicates with just an annotation field filled out but NO Attachment field. This causes broken images in the UI because the record exists but has no actual image attachment. Need to prevent creating attachment records without the Attachment field populated.",
      "acceptanceCriteria": [
        "Never create attachment records without Attachment field populated",
        "Annotation updates should UPDATE existing records, not INSERT new ones",
        "No duplicate attachment records for the same image",
        "Broken images eliminated from UI",
        "Validate Attachment field before INSERT to LPS_Services_Visuals_Attach"
      ],
      "technicalApproach": [
        "Audit code that creates LPS_Services_Visuals_Attach records",
        "Ensure annotation saves UPDATE existing record by AttachID, not INSERT new",
        "Add validation to prevent INSERT without Attachment field",
        "Clean up existing orphaned records without Attachment field"
      ],
      "priority": 2,
      "passes": false,
      "dependsOn": []
    }
  ],
  "metadata": {
    "updatedAt": "2026-01-14T03:34:26.241Z"
  }
}